Catalogs/DMS_ПереченьОперацийКСиТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_ПереченьОперацийКСиТО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_ПереченьОперацийКСиТО/Ext/ManagerModule.bsl
Процедура ОбновитьПеречень() Экспорт

	//Безопасность
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ДиагностикаЭБУ.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ЗазорыВШаровыхШарнирах.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СистемаГУР.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СистемаОхлаждения.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СостояниеИДавлениеВШинах.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СостояниеЗарядкиАКБ.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СостояниеТормозныхДисков.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СостояниеТормозныхКолодок.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ТормознаяСистма.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	//Двигатель и уровень жидкостей
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ГерметичностьСистемыГУР.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ГерметичностьСистемыОхлаждения.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ГерметичностьТормознойСистемы.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.УровеньЖидкостиВБачкеОмывателя.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.УровеньЖидкостиВГУР.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.УровеньТормознойЖидкости.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	//Обзорность
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ВетровоеСтеклоИЗеркалаЗаднегоВида.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ОгниЗаднегоХода.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ОсвещениеНомерныхЗнаков.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ПодсветкаВКозырьках.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ПротивотуманныеФары.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СигнальныеЛампыПриборнойПанели.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.Фары.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ЩеткиПереднегоИЗаднегоСтеклоочистителей.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	//Прочее
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.ЗаменаСалонногоФильтра.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.КонтрольЭффективностиРаботыСистемыКондиционирования.ПолучитьОбъект(); ОперацияОбъект.КС = Ложь; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();
	ОперацияОбъект = Справочники.DMS_ПереченьОперацийКСиТО.СостояниеКолесныхДисков.ПолучитьОбъект(); ОперацияОбъект.КС = Истина; ОперацияОбъект.ТО = Истина; ОперацияОбъект.Записать();

КонецПроцедуры
